# Assignment: 01

#### Load the Iris dataset into a pandas DataFrame

In [33]:
import numpy as np 
import pandas as pd
import seaborn as sns

df = sns.load_dataset('iris')
df.head(2)
df.shape

(150, 5)

#### 1. Calculate the 75th percentile of the 'petal_width' column for each species in the Iris dataset.

In [2]:
df['petal_width'].quantile(0.75)

1.8

#### 2. Create a new column in the Iris DataFrame called 'sepal_area', which is the product of 'sepal_length' and 'sepal_width'.

In [3]:
df['sepal_area'] = df['sepal_length']*df['sepal_width']
df.head(2)

   sepal_length  sepal_width  petal_length  petal_width species  sepal_area
0           5.1          3.5           1.4          0.2  setosa       17.85
1           4.9          3.0           1.4          0.2  setosa       14.70

#### 3. Remove all rows in the Iris DataFrame where 'petal_length' is greater than twice the standard deviation of 'petal_length' for that species.

In [4]:
petal_length_std = df['petal_length'].std()
petal_length_std

1.7652982332594662

In [5]:
df = df.drop(df[df['petal_length'] > 2*petal_length_std].index)

#### 4. Normalize all numerical columns in the Iris DataFrame (except the 'species' column) using Min-Max scaling.

In [6]:
df.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'species',
       'sepal_area'],
      dtype='object')

In [7]:
from sklearn.preprocessing import MinMaxScaler

scaler = MinMaxScaler()
model = scaler.fit(df[['sepal_length', 'sepal_width', 'petal_length', 'petal_width','sepal_area']])
scaled_data = model.transform(df[['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'sepal_area']])

In [9]:
model.get_feature_names_out()

array(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'sepal_area'], dtype=object)

In [11]:
Scaled_df = pd.DataFrame(scaled_data, columns=scaler.get_feature_names_out())
Scaled_df.describe()

       sepal_length  sepal_width  petal_length  petal_width  sepal_area
count     55.000000    55.000000     55.000000    55.000000   55.000000
mean       0.478788     0.554545      0.252364     0.216364    0.450591
std        0.232747     0.199967      0.226650     0.246279    0.212070
min        0.000000     0.000000      0.000000     0.000000    0.000000
25%        0.333333     0.458333      0.160000     0.100000    0.316313
50%        0.466667     0.583333      0.200000     0.100000    0.452918
75%        0.600000     0.666667      0.240000     0.250000    0.571286
max        1.000000     1.000000      1.000000     1.000000    1.000000

In [12]:
df.describe()

       sepal_length  sepal_width  petal_length  petal_width  sepal_area
count     55.000000    55.000000     55.000000    55.000000   55.000000
mean       5.018182     3.330909      1.630909     0.316364   16.794909
std        0.349121     0.479920      0.566625     0.246279    3.198022
min        4.300000     2.000000      1.000000     0.100000   10.000000
25%        4.800000     3.100000      1.400000     0.200000   14.770000
50%        5.000000     3.400000      1.500000     0.200000   16.830000
75%        5.200000     3.600000      1.600000     0.350000   18.615000
max        5.800000     4.400000      3.500000     1.100000   25.080000

### 3. Find the three most common combinations of 'sepal_length', 'sepal_width', and 'petal_length' in the Iris dataset.

In [14]:
# Creating sub dataset
subset_df = Scaled_df[['sepal_length', 'sepal_width', 'petal_length']]

# Group by and count the occurrences
subset_df.value_counts().reset_index(name='count').head(3)

   sepal_length  sepal_width  petal_length  count
0      0.533333     0.625000          0.16      2
1      0.400000     0.458333          0.20      2
2      0.333333     0.416667          0.16      2

In [19]:
Scaled_df[['sepal_length','sepal_width']].value_counts().reset_index(name='count')

    sepal_length  sepal_width  count
0       0.533333     0.750000      3
1       0.466667     0.583333      2
2       0.266667     0.500000      2
3       0.533333     0.625000      2
4       0.400000     0.458333      2
5       0.733333     0.583333      2
6       0.333333     0.416667      2
7       0.333333     0.583333      2
8       0.733333     0.791667      2
9       0.466667     0.625000      2
10      0.733333     0.708333      1
11      0.800000     0.625000      1
12      0.800000     0.916667      1
13      0.533333     0.208333      1
14      0.666667     0.708333      1
15      0.600000     0.875000      1
16      0.933333     0.250000      1
17      0.600000     0.625000      1
18      0.600000     0.583333      1
19      0.933333     0.750000      1
20      0.533333     0.708333      1
21      0.933333     1.000000      1
22      0.533333     0.583333      1
23      0.533333     0.541667      1
24      0.000000     0.416667      1
25      0.466667     0.666667      1
26      0.333333     0.458333      1
27      0.066667     0.416667      1
28      0.066667     0.500000      1
29      0.133333     0.125000      1
30      0.200000     0.458333      1
31      0.200000     0.500000      1
32      0.200000     0.583333      1
33      0.200000     0.666667      1
34      0.400000     0.166667      1
35      0.066667     0.375000      1
36      0.400000     0.416667      1
37      0.400000     0.666667      1
38      0.466667     0.000000      1
39      0.466667     0.125000      1
40      0.466667     0.416667      1
41      0.466667     0.500000      1
42      0.466667     0.541667      1
43      1.000000     0.833333      1

### 6.  Group the Iris DataFrame by 'species' and find the row with the highest 'sepal_width' for each group.

In [23]:
df.groupby(['species'], as_index=False)['sepal_width'].max()

      species  sepal_width
0      setosa          4.4
1  versicolor          2.6

In [22]:
df['species'].value_counts()

setosa        50
versicolor     5
Name: species, dtype: int64

### 7.  Replace all negative values in the 'petal_width' column of the Iris DataFrame with the mean of the non-negative values in that column.

In [32]:
df[['petal_width']][df['petal_width']>0]

    petal_width
0           0.2
1           0.2
2           0.2
3           0.2
4           0.2
5           0.4
6           0.3
7           0.2
8           0.2
9           0.1
10          0.2
11          0.2
12          0.1
13          0.1
14          0.2
15          0.4
16          0.4
17          0.3
18          0.3
19          0.3
20          0.2
21          0.4
22          0.2
23          0.5
24          0.2
25          0.2
26          0.4
27          0.2
28          0.2
29          0.2
30          0.2
31          0.4
32          0.1
33          0.2
34          0.2
35          0.2
36          0.2
37          0.1
38          0.2
39          0.2
40          0.3
41          0.3
42          0.2
43          0.6
44          0.4
45          0.3
46          0.2
47          0.2
48          0.2
49          0.2
57          1.0
60          1.0
79          1.0
93          1.0
98          1.1

In [26]:
non_negative_mean_petal_width = df['petal_width'][df['petal_width']>0].mean()

df['petal_width'][df['petal_width']<0] = non_negative_mean_petal_width

0.31636363636363635

### 8. Calculate the correlation matrix for the 'sepal_length', 'sepal_width', 'petal_length', and 'petal_width' columns in the Iris dataset and find the feature with the highest absolute correlation with 'petal_width'.

In [34]:
df.corr()

              sepal_length  sepal_width  petal_length  petal_width
sepal_length      1.000000    -0.117570      0.871754     0.817941
sepal_width      -0.117570     1.000000     -0.428440    -0.366126
petal_length      0.871754    -0.428440      1.000000     0.962865
petal_width       0.817941    -0.366126      0.962865     1.000000

# Assignment: 02

### Load the Titanic Dataset

In [2]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [6]:
df = sns.load_dataset('titanic')
df.sample(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
446,1,2,female,13.0,0,1,19.50,S,Second,child,False,NaN,Southampton,yes,False
461,0,3,male,34.0,0,0,8.05,S,Third,man,True,NaN,Southampton,no,True
842,1,1,female,30.0,0,0,31.00,C,First,woman,False,NaN,Cherbourg,yes,True

In [7]:
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

### 1. Find the average age of passengers for each class (1st, 2nd, and 3rd).

In [4]:
df.groupby(['class'], as_index=False)['age'].mean()

    class        age
0   First  38.233441
1  Second  29.877630
2   Third  25.140620

### 2. Create a new DataFrame that contains the count of male and female passengers in each age group (e.g., 0-10, 11-20, etc.).

In [8]:
# new_df = 
df['age'].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: age, dtype: float64

In [23]:
df['age_group'] = pd.cut(df['age'], 8)

In [42]:
df[['age','age_group']].sample(3)

      age         age_group
193   3.0    (0.34, 10.368]
474  22.0  (20.315, 30.263]
126   NaN               NaN

In [65]:
df.groupby(['age_group', 'sex'],as_index=False).size()

           age_group     sex  size
0     (0.34, 10.368]  female    31
1     (0.34, 10.368]    male    33
2   (10.368, 20.315]  female    46
3   (10.368, 20.315]    male    69
4   (20.315, 30.263]  female    81
5   (20.315, 30.263]    male   149
6    (30.263, 40.21]  female    55
7    (30.263, 40.21]    male   100
8    (40.21, 50.158]  female    31
9    (40.21, 50.158]    male    55
10  (50.158, 60.105]  female    14
11  (50.158, 60.105]    male    28
12  (60.105, 70.052]  female     3
13  (60.105, 70.052]    male    14
14    (70.052, 80.0]  female     0
15    (70.052, 80.0]    male     5